Tekla Open API Reference for Tekla Structures 2025
ModelHistory.GetModifications Method (String, ModificationStamp)
Lookup modifications since previous call of TakeModifications() without resetting the modstamp
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ModificationInfo GetModifications(
	string Name,
	ModificationStamp PrevStamp = null
)
Public Shared Function GetModifications (
	Name As String,
	Optional PrevStamp As ModificationStamp = Nothing
) As ModificationInfo
Parameters
Name
Type: System.String
Name of reference which is used for collecting modifications and which is updated. Intended use is to assign an unique name for each client application which needs to be informed of the model updates. Maximum length is 79 characters.
PrevStamp (Optional)
Type: Tekla.Structures.Model.History.ModificationStamp
When specified, default value of reference if is it not found
Return Value
Type: ModificationInfo
All modifications which happened since the last call
Remarks
Takes modification which has happened to the model since the previous call to TakeModifications with the same Name argument. If there was no previous call of TakeModifications() with this Name, shows modifications since beginning, or since PrevStap, if it is specified.
See Also
Reference
ModelHistory Class
GetModifications Overload
Tekla.Structures.Model.History Namespace